---
title: RebarShapeVertex
classe: Autodesk.Revit.DB.Structure.RebarShapeVertex
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# RebarShapeVertex

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `RebarShapeBendAngle BendAngle { get; set; }` | `rebarShapeVertex.BendAngle` | RebarShapeBendAngle |
| `Boolean IsValidObject { get; }` | `rebarShapeVertex.IsValidObject` | Boolean |
| `RebarShapeVertexTurn Turn { get; set; }` | `rebarShapeVertex.Turn` | RebarShapeVertexTurn |
| `Void Dispose()` | `rebarShapeVertex.Dispose()` | Void |
| `IList<RebarShapeConstraint> GetConstraints()` | `rebarShapeVertex.GetConstraints()` | IList<RebarShapeConstraint> |
| `Void SetConstraints(IList<RebarShapeConstraint>)` | `rebarShapeVertex.SetConstraints(constraints)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```